;------------------------------------------------------------
;源程序名称：Loader.asm
;说明：装载操作系统核心并跳转保护模式
;加载：此程序被引导程序加载至800[0]:0000处开始执行
;------------------------------------------------------------
 org 0x0100
 jmp start   ;偏移0处必须是可执行的x86指令
;------------------------------------------------------------
bMeOSname db 7ch,5ch,20h,20h,20h,20h,20h,20h,20h,20h,2fh,7ch,20h,20h,2dh,2dh
		  db 2dh,2dh,2dh,2dh,20h,20h,0dh,0ah,7ch,20h,5ch,20h,20h,20h,20h,20h
		  db 20h,2fh,20h,7ch,20h,7ch,20h,20h,20h,20h,20h,20h,7ch,20h,0dh,0ah
		  db 7ch,20h,20h,5ch,20h,20h,20h,20h,2fh,20h,20h,7ch,20h,7ch,20h,20h
		  db 20h,20h,20h,20h,7ch,20h,0dh,0ah,7ch,20h,20h,20h,5ch,20h,20h,2fh
		  db 20h,20h,20h,7ch,20h,7ch,20h,20h,20h,20h,20h,20h,7ch,20h,0dh,0ah
		  db 7ch,20h,20h,20h,20h,5ch,2fh,20h,20h,20h,20h,7ch,20h,20h,2dh,2dh
		  db 2dh,2dh,2dh,2dh,20h,5ch,0dh,0ah,20h,20h,20h,20h,20h,20h,20h,20h
		  db 20h,20h,20h,20h,20h,20h,20h,20h,20h,20h,32h,30h,31h,36h
OSNAME_SIZE equ $-bMeOSname
bLoading db 'Loading...'
;------------------------------------------------------------
start:
 cli
 mov ax,cs   ;此时CS为800
 mov ds,ax   ;将DS设为CS相同的段，方便寻址数据
 sti
;------------------------------------------------------------
     ;首先清除屏幕
 mov ax,0003h
 int 10h
;------------------------------------------------------------
     ;显示操作系统名称
 mov si,bMeOSname
 mov cx,OSNAME_SIZE
_showLoading:
 lodsb
 mov ah,0eh
 int 10h
 loop _showLoading
;------------------------------------------------------------

 jmp $

;------------------------------------------------------------

;源程序Loader.asm结束
;------------------------------------------------------------ 
